import 'dart:io';

void main() {
  print('**Навички**');
  print('Мови програмування:');
  print('* C++');
  print('* Python');
  print('* Dart (початкові навички)');
  print('Бекенд технології:');
  print('* Розробка простих додатків');
  print('* Використання баз даних');
  print('* API розробка');
  print('Інші технічні навички:');
  print('* Версійний контроль (Git)');
  print('* Робота з командним рядком');
  print('* Знання архітектурних патернів');
  print('**Проекти**');
  print('* Використання Python');
  print('* Робота з базою даних');
  print('* Реалізація RESTful API для взаємодії з клієнтськими додатками');
  print('* Ігровий проект на C++');
  print('* Використання C++');
  print('* Розробка графічного інтерфейсу та обробки введення користувача');
  print('**Самонавчання**');
  print('* Працюю над вдосконаленням навичок у розробці веб-застосунків за допомогою фреймворка Flask на Python.');
  print('* Також активно вивчаю мову програмування Dart для розширення своїх можливостей у розробці мобільних додатків.');
  print('**Мови**');
  print('* Українська (рідна)');
  print('* Англійська (продвинутий рівень)');
  print('**Заключення**');
  print('Маю бажання розвиватися та долучитися до проектів, де я можу використовувати свої навички та навчатися від досвідчених колег. Готовий приймати виклики та працювати у команді для досягнення спільних цілей.');
}